orderPricePlan/templates/payloads/CreateSubscriber_prepaid.txt

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bcs="http://172.22.26.40:8080/services/BcServices " xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon" xmlns:bcc="http://www.huawei.com/bme/cbsinterface/bccommon">
   <soapenv:Header/>
   <soapenv:Body>
      <bcs:CreateSubscriberRequestMsg>
         <RequestHeader>
            <cbs:Version>1</cbs:Version>
            <cbs:MessageSeq>${=new java.text.SimpleDateFormat("yyyy-MM-dd'T'HH:mm:ss.SSS").format(new Date())}</cbs:MessageSeq>
            <cbs:AccessSecurity>
               <cbs:LoginSystemCode>102</cbs:LoginSystemCode>
               <cbs:Password>7/PuyYwNpRtSX7jDpxnl2ECAvuVYH2Mu9zxqgPGJrPYYK73MCZN7DvrDepA=</cbs:Password>
            </cbs:AccessSecurity>
            <cbs:OperatorInfo>
               <cbs:OperatorID>101</cbs:OperatorID>
            </cbs:OperatorInfo>
         </RequestHeader>
         <CreateSubscriberRequest>
            <bcs:RegisterCustomer OpType="1">
               <bcs:CustKey>cust9235001020</bcs:CustKey>
               <bcs:CustInfo>
                  <bcc:CustBasicInfo>
                     <bcc:CustLevel>1</bcc:CustLevel>
                  </bcc:CustBasicInfo>
               </bcs:CustInfo>
               <bcs:IndividualInfo>
                  <bcc:Title>1</bcc:Title>
                  <bcc:FirstName>FN_test_WS</bcc:FirstName>
                  <bcc:MiddleName>MN_test_WS</bcc:MiddleName>
                  <bcc:LastName>LN_test_WS</bcc:LastName>
                  <bcc:Gender>1</bcc:Gender>
               </bcs:IndividualInfo>
            </bcs:RegisterCustomer>
            <bcs:Account>
               <bcs:AcctKey>acct9235001020</bcs:AcctKey>
               <bcs:AcctInfo>
                  <bcc:AcctCode>acct9235001020</bcc:AcctCode>
                  <bcc:AcctBasicInfo>
                     <bcc:AcctName>AcctName</bcc:AcctName>
                     <bcc:BillLang>2003</bcc:BillLang>
                     <bcc:ContactInfo>
                        <bcc:Title>1</bcc:Title>
                        <bcc:FirstName>FN_testAcct_WS</bcc:FirstName>
                        <bcc:MiddleName>MN_testAcct_WS</bcc:MiddleName>
                        <bcc:LastName>LN_testAcct_WS</bcc:LastName>
                     </bcc:ContactInfo>
                  </bcc:AcctBasicInfo>
                  <bcc:BillCycleType>01</bcc:BillCycleType>
                  <bcc:AcctType>1</bcc:AcctType>
                  <bcc:PaymentType>0</bcc:PaymentType>
                  <bcc:AcctClass>1</bcc:AcctClass>
                  <bcc:CurrencyID>1069</bcc:CurrencyID>
                  <bcc:InitBalance>99999999</bcc:InitBalance>
                  <bcc:AcctPayMethod>1</bcc:AcctPayMethod>
               </bcs:AcctInfo>
            </bcs:Account>
            <bcs:Subscriber>
               <bcs:SubscriberKey>9235001020</bcs:SubscriberKey>
               <bcs:SubscriberInfo>
                  <bcc:SubBasicInfo>
                     <bcc:WrittenLang>2003</bcc:WrittenLang>
                     <bcc:IVRLang>2003</bcc:IVRLang>
                     <bcc:SubLevel>1</bcc:SubLevel>
                     <bcc:DunningFlag>1</bcc:DunningFlag>
                  </bcc:SubBasicInfo>
                  <bcc:UserCustomerKey>cust9235001020</bcc:UserCustomerKey>
                  <bcc:SubIdentity>
                     <bcc:SubIdentityType>1</bcc:SubIdentityType>
                     <bcc:SubIdentity>9235001020</bcc:SubIdentity>
                     <bcc:PrimaryFlag>1</bcc:PrimaryFlag>
                  </bcc:SubIdentity>
                  <bcc:SubClass>1</bcc:SubClass>
                  <bcc:NetworkType>1</bcc:NetworkType>
                  <bcc:Status>2</bcc:Status>
               </bcs:SubscriberInfo>
               <bcs:SubPaymentMode>
                  <bcs:PaymentMode>0</bcs:PaymentMode>
                  <bcs:PayRelationKey>acct9235001020</bcs:PayRelationKey>
                  <bcs:AcctKey>acct9235001020</bcs:AcctKey>
               </bcs:SubPaymentMode>
            </bcs:Subscriber>
            <bcs:PrimaryOffering>
               <bcc:OfferingKey>
                  <bcc:OfferingID>70</bcc:OfferingID>
               </bcc:OfferingKey>
               <bcc:BundledFlag>S</bcc:BundledFlag>
               <bcc:OfferingClass>I</bcc:OfferingClass>
            </bcs:PrimaryOffering>
         </CreateSubscriberRequest>
      </bcs:CreateSubscriberRequestMsg>
   </soapenv:Body>
</soapenv:Envelope>